* Dickminer
** Needed Data:
Count number of Rick-Rolled people + page + time + location
command line utility
output format JSON
** Interact with mined Data
*** DONE query all the cities countrys and pages
CLOSED: [2015-07-10 Fr 17:51]
CLOCK: [2015-07-09 Do 22:24]--[2015-07-10 Fr 16:34] => 18:10
*** DONE write a shell to interact with the application
CLOSED: [2015-07-10 Fr 17:52]
kind of done. For now it's just a ~getLine~
*** DONE incorporate rrType into pageHit datatype
CLOSED: [2015-07-09 Do 22:11]
CLOCK: [2015-07-09 Do 22:04]--[2015-07-09 Do 22:11] =>  0:07
*** DONE parse old format aswell
CLOSED: [2015-07-10 Fr 18:23]
CLOCK: [2015-07-10 Fr 17:58]--[2015-07-10 Fr 18:22] =>  0:24
*** DONE refactor the file Input into it's own module
CLOSED: [2015-07-09 Do 22:23]
CLOCK: [2015-07-09 Do 22:11]--[2015-07-09 Do 22:23] =>  0:12
*** TODO Write Test for the IO functionality
CLOCK: [2015-07-11 Sa 01:25]--[2015-07-11 Sa 01:41] =>  0:16
** Serve a RESTApi
*** DONE Set Up dependencies (Hello Universe)
CLOSED: [2015-07-11 Sa 01:47]
CLOCK: [2015-07-11 Sa 01:41]--[2015-07-11 Sa 01:46] =>  0:05

*** DONE call into Dickminer Library
CLOSED: [2015-07-11 Sa 02:17]
CLOCK: [2015-07-11 Sa 01:48]--[2015-07-11 Sa 01:50] =>  0:02

